;Date: 11/08/2022
;Author: Claude Roux
;Description: Example of Basicois code

(load (+ _current "hellenica.lisp")) 
(load (+ _current "transpiler.lisp"))

(setq code 
   ` 
συνάρτηση κλήση(A, B)
   Γ = 20
   αν A == B τότε
      Γ = Γ + 100
   αλλιώς
      Γ = Γ + A * B
      εμφάνισεγρ "κλήση:", Γ
   τέλοςαν
   επιστροφή Γ
τέλοςσυνάρτησης

συνάρτηση παραγοντικό(α)
   αν α <> 1 τότε
      α * παραγοντικό(α-1)
   αλλιώς
      1
   τέλοςαν
τέλοςσυνάρτησης

διάσταση Π[5,5,5]
διάσταση Π$[5,5,5]
διάσταση Δ[100]
διάσταση Ξ$[100]

Π = εύρος(0, 125,1)
Π[1,1,1] = 100
εμφάνισεγρ "Π[0,1]=", Π[0,1]
εμφάνισεγρ "Π[1,4,4]=", Π[1,4,4]

ε = 10 + 20 / 3
εμφάνισεγρ "ε=",ε
ε = 10 + (20 / 3)
εμφάνισεγρ "ε=",ε

AZ = ακέραιοι(1, 2, 3)
AZ.στοιβάζω(100, 200, 300*-1)
εμφάνισεγρ AZ[2], AZ.μέγεθος(), AZ, AZ[1].cos()

A12 = -9.987
A = 100
B = 30
E = 3
C$ = "Συμβολοσειρά δοκιμής"

Ξ$[10] = "Δοκιμή διαστάσεων"
Δ[10] = -1 + A + B + 10

A12 =  -1 * B

αν A12 < 0 τότε
   εμφάνισεγρ "αρνητικό:", A12
   A12 = A12 * -1
   εμφάνισεγρ "A12 είναι:", A12
τέλοςαν

αν A12 > 0 τότε
   εμφάνισεγρ "Θετικό:", A12
αλλιώς
   εμφάνισεγρ "αρνητικό:", A12
τέλοςαν

A = A + (100 * B) + 20

B = sin(E) + A

εμφάνισεγρ "C:", C$.μέγεθος()

εμφάνισεγρ "συνημίτονο:", cos(10)

εμφάνισεγρ("αξίες:", A + 100 , C$, Δ[10], Ξ$[10])

αν A + 12 <> 11 ή B == 30 ή E == 101 τότε
   A = A + 1
   C$ = C$ + ": τότε"
   εμφάνισεγρ "τότε:", A, C$
αλλιώς
   B = B - A
   εμφάνισεγρ "αλλιώς:", B
τέλοςαν

A = 100

ενώ A > 10
   A = A - 1
   εμφάνισε A, ","
τέλοςενώ

εμφάνισεγρ()
για A = 0, A < 10 , A = A + 1 
   εμφάνισε "A=", A, " -> "
   για B = 0, B <= 10, B = B + 2
       εμφάνισεγρ "A + B=", A, B, (A + B), " "
   τέλοςγια
τέλοςγια

για A μέσα εύρος(1,10,1)
    εμφάνισεγρ "A μέσα:", A
    εμφάνισεγρ "Εκτελούμε έναν βρόχο"
τέλοςγια

εμφάνισεγρ()
εμφάνισεγρ "εδώ:", κλήση(10,10)
εμφάνισεγρ "Εδώ:", κλήση(10,10+40)

εμφάνισεγρ "παραγοντικό:", παραγοντικό(9)

Kδεδομένα = δεδομένα 10, 20, 30, 40, 50, "A", "B", "C" τέλοςδεδομένα
εμφάνισεγρ Kδεδομένα, Kδεδομένα[5], Kδεδομένα.μέγεθος()

αν "ab" μέσα "abc" τότε
   εμφάνισεγρ "ναι"
αλλιώς
   εμφάνισεγρ "όχι"
τέλοςαν

εμφάνισεγρ αριθμός("199") + 20.98

περιεχόμενο = διαβάστεαρ(_current + "hellenica")
εμφάνισεγρ μέγεθος(περιεχόμενο.εξάγετε(0, "μέσα"))

REM Μια συνάρτηση λάμδα

A = [(x,y) αν x > y τότε x+y αλλιώς x*y τέλοςαν](10,20)
εμφάνισεγρ A

`
)

;(setq tree (abstract_tree code))

(println 'χρόνο
   (elapse
      (setq lsp (transpile code))
   )
)

;lsp contains the transpiled code as a list
;(println (prettify lsp))
(eval lsp)

