;Date: 11/08/2022
;Author: Claude Roux
;Description: Εxample of Βasicois code

(load (+ _current "hellenica.lisp")) 
(load (+ _current "transpiler.lisp"))

(setq code 
   ` 
συνάρτηση κλήση(Α, Β)
   Γ = 20
   αν Α == Β τότε
      Γ = Γ + 100
   αλλιώς
      Γ = Γ + Α * Β
      εμφάνισεγρ "κλήση:", Γ
   τέλοςαν
   επιστροφή Γ
τέλοςσυνάρτησης

συνάρτηση παραγοντικό(α)
   αν α <> 1 τότε
      α * παραγοντικό(α-1)
   αλλιώς
      1
   τέλοςαν
τέλοςσυνάρτησης

διάσταση Π[5,5,5]
διάσταση Π$[5,5,5]
διάσταση Δ[100]
διάσταση Ξ$[100]

Π = εύρος(0, 125,1)
Π[1,1,1] = 100
εμφάνισεγρ "Π[0,1]=", Π[0,1]
εμφάνισεγρ "Π[1,4,4]=", Π[1,4,4]

ε = 10 + 20 / 3
εμφάνισεγρ "ε=",ε
ε = 10 + (20 / 3)
εμφάνισεγρ "ε=",ε

ΑΩ = ακέραιοι(1, 2, 3)
ΑΩ.στοιβάζω(100, 200, 300*-1)
εμφάνισεγρ ΑΩ[2], ΑΩ.μέγεθος(), ΑΩ, ΑΩ[1].κοσ()

Α12 = -9.987
Α = 100
Β = 30
Ε = 3
Θ$ = "Συμβολοσειρά δοκιμής"

Ξ$[10] = "Δοκιμή διαστάσεων"
Δ[10] = -1 + Α + Β + 10

Α12 =  -1 * Β

αν Α12 < 0 τότε
   εμφάνισεγρ "αρνητικό:", Α12
   Α12 = Α12 * -1
   εμφάνισεγρ "Α12 είναι:", Α12
τέλοςαν

αν Α12 > 0 τότε
   εμφάνισεγρ "Θετικό:", Α12
αλλιώς
   εμφάνισεγρ "αρνητικό:", Α12
τέλοςαν

Α = Α + (100 * Β) + 20

Β = ιγμόρεια(Ε) + Α

εμφάνισεγρ "Θ:", Θ$.μέγεθος()

εμφάνισεγρ "συνημίτονο:", κοσ(10)

εμφάνισεγρ("αξίες:", Α + 100 , Θ$, Δ[10], Ξ$[10])

αν Α + 12 <> 11 ή Β == 30 ή Ε == 101 τότε
   Α = Α + 1
   Θ$ = Θ$ + ": τότε"
   εμφάνισεγρ "τότε:", Α, Θ$
αλλιώς
   Β = Β - Α
   εμφάνισεγρ "αλλιώς:", Β
τέλοςαν

Α = 100

ενώ Α > 10
   Α = Α - 1
   εμφάνισε Α, ","
τέλοςενώ

εμφάνισεγρ()
για Α = 0, Α < 10 , Α = Α + 1 
   εμφάνισε "Α=", Α, " -> "
   για Β = 0, Β <= 10, Β = Β + 2
       εμφάνισεγρ "Α + Β=", Α, Β, (Α + Β), " "
   τέλοςγια
τέλοςγια

για Α μέσα εύρος(1,10,1)
    εμφάνισεγρ "Α μέσα:", Α
    εμφάνισεγρ "Εκτελούμε έναν βρόχο"
τέλοςγια

εμφάνισεγρ()
εμφάνισεγρ "εδώ:", κλήση(10,10)
εμφάνισεγρ "Εδώ:", κλήση(10,10+40)

εμφάνισεγρ "παραγοντικό:", παραγοντικό(9)

Kδεδομένα = δεδομένα 10, 20, 30, 40, 50, "Α", "Β", "Θ" τέλοςδεδομένα
εμφάνισεγρ Kδεδομένα, Kδεδομένα[5], Kδεδομένα.μέγεθος()

αν "ab" μέσα "abc" τότε
   εμφάνισεγρ "ναι"
αλλιώς
   εμφάνισεγρ "όχι"
τέλοςαν

εμφάνισεγρ αριθμός("199") + 20.98

περιεχόμενο = διαβάστεαρ(_current + "hellenica")
εμφάνισεγρ μέγεθος(περιεχόμενο.εξάγετε(0, "μέσα"))

REM Μια συνάρτηση λάμδα

Α = [(x,y) αν x > y τότε x+y αλλιώς x*y τέλοςαν](10,20)
εμφάνισεγρ Α

`
)

;(setq tree (abstract_tree code))

(println 'χρόνο
   (elapse
      (setq lsp (transpile code))
   )
)

;lsp contains the transpiled code as a list
;(println (prettify lsp))
(eval lsp)

